# TASK 1

# 01 Import Analysis Libraries

In [3]:
import pandas as pd
import numpy as np
import os

# 02 Import DataFrames

## Path Creation

In [6]:
#Creating path 
path = r'/Users/Andreas/Desktop/13-02-2025 Instacart Basket Analysis/02 Data'

In [7]:
#Checkking output
path

'/Users/Andreas/Desktop/13-02-2025 Instacart Basket Analysis/02 Data'

## Import customer.csv

In [9]:
#Creating dataframe df_cust from customers.csv
df_cust = pd.read_csv(os.path.join(path, 'Original Data', 'customers.csv'))

In [10]:
#Creating dataframe df_o_p_m from orders_products_merge.pkl
df_o_p_m = pd.read_pickle(os.path.join(path, 'Prepared Data', 'orders_products_merged', 'orders_products_merge3.pkl'))

In [11]:
#Checking output
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# 03 Data inspection

## Data shape

In [14]:
df_o_p_m.shape

(32404859, 24)

In [15]:
df_cust.shape

(206209, 10)

## Data Description

In [17]:
df_cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

## Data type check

In [19]:
#Checking Data Types of df_cust
df_cust.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [20]:
#changing data size to accomodate ram nd make user_id data type match
df_cust['user_id'] = df_cust['user_id'].astype('str')
df_cust['Age'] = df_cust['Age'].astype('int8')
df_cust['n_dependants'] = df_cust['n_dependants'].astype('int8')
df_cust['income'] = df_cust['income'].astype('int8')

In [21]:
df_o_p_m.dtypes

product_id                  int32
product_name               object
aisle_id                    int16
department_id               int16
prices                    float64
order_id                    int32
user_id                     int32
order_number                int16
orders_day_of_week          int16
order_hour_of_day           int16
days_without_ordering     float16
add_to_cart_order           int16
reordered                   int16
_merge                   category
price_label                object
busiest_day                object
busiest_days               object
busiest_period_of_day      object
max_order                   int16
loyalty_flag               object
user_mean_price           float64
Spender_habit              object
median_days_no_order      float16
Customer Type              object
dtype: object

# 04 Wrangling Data

## Renaming Columns

In [24]:
#Changing Column names for uniformity in df_cust {old name : new name}

df_cust.rename(columns = {'First Name' : 'first_name'}, inplace = True)
df_cust.rename(columns = {'Surnam' : 'surname'}, inplace = True)
df_cust.rename(columns = {'Gender' : 'gender'}, inplace = True)
df_cust.rename(columns = {'Age' : 'age'}, inplace = True)
df_cust.rename(columns = {'n_dependants' : 'number_of_dependants'}, inplace = True)
df_cust.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)
df_cust.rename(columns = {'STATE' : 'state'}, inplace = True)

In [25]:
#checking name change was successful for df_cust
df_cust.head(1)

,user_id,first_name,surname,gender,state,age,date_joined,number_of_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,33

In [26]:
#Changing Column names for uniformity in df_o_p_m {old name : new name}
df_o_p_m.rename(columns = {'Spender habit' : 'spender_habit'}, inplace = True)
df_o_p_m.rename(columns = {'Customer Type' : 'customer_type'}, inplace = True)

In [27]:
#checking name change was successful for df_o_p_m
df_o_p_m.head(1)

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,price_label,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,user_mean_price,Spender_habit,median_days_no_order,customer_type
0,1,Chocolate Sandwich Cookies,61,19,5.800781,3139998,138,28,6,11,...,Mid-range product,Regularly busy,Regularly busy days,Most Orders,32,Regular Customer,6.936029,Low Spender,8.0,Frequent Customer

## Removing Columns

df_cust reason for not removing columns

In df_cust I will not be removing any of the columns they are helpful for extra analyses outside of what we need for answering Key Questions asked by client that may still benefit them. Thus I have decided to keep them.

In [30]:
# removing columns from df_o_p_m that are unnecessary

df_o_p_m = df_o_p_m.drop(columns = ['_merge' , 'busiest_day'])

In [31]:
# checking for removal of the columns a total of 22 should show on columns as initial shape check was 24
df_o_p_m.shape

(32404859, 22)

## Duplicates Check

In [33]:
# creating new dataframe for duplicates in df_cust
df_c_dups = df_cust.duplicated()

In [34]:
# using new dataframe to count duplpicates 
df_c_dups.value_counts(dropna=False)

False    206209
Name: count, dtype: int64

## Mixed Data Type check

In [36]:
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].map(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

first_name

In [37]:
# Changing first_name into 'str' as it is a mixed-data-type
df_cust['first_name'] = df_cust['first_name'].astype('str')

In [38]:
# Changing user_id and order_id for df_o_p_m
df_o_p_m['user_id'] = df_o_p_m['user_id'].astype('str')
df_o_p_m['order_id'] = df_o_p_m['order_id'].astype('str')

In [39]:
# checking output
df_cust['user_id'].dtypes

dtype('O')

In [40]:
df_o_p_m['user_id'].dtypes

dtype('O')

In [41]:
df_o_p_m['order_id'].dtypes

dtype('O')

## Null Value Check

In [43]:
df_cust.isnull().sum()

user_id                 0
first_name              0
surname                 0
gender                  0
state                   0
age                     0
date_joined             0
number_of_dependants    0
marital_status          0
income                  0
dtype: int64

# 05 Merging Data sets

In [45]:
# creating new dataframe df_c_o_p_m by merging df_o_p_m and df_cust on user_id
df_c_o_p_m = df_o_p_m.merge(df_cust, on = 'user_id', indicator = True)

In [46]:
#output check
df_c_o_p_m.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,first_name,surname,gender,state,age,date_joined,number_of_dependants,marital_status,income,_merge
0,1,Chocolate Sandwich Cookies,61,19,5.800781,3139998,138,28,6,11,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,-44,both
1,1,Chocolate Sandwich Cookies,61,19,5.800781,1977647,138,30,6,17,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,-44,both
2,1,Chocolate Sandwich Cookies,61,19,5.800781,389851,709,2,0,21,...,Deborah,Glass,Female,Vermont,66,6/16/2018,2,married,94,both
3,1,Chocolate Sandwich Cookies,61,19,5.800781,652770,764,1,3,13,...,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,76,both
4,1,Chocolate Sandwich Cookies,61,19,5.800781,1813452,764,3,4,17,...,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,76,both

In [47]:
#shape check
df_c_o_p_m.shape

(32404859, 32)

In [48]:
#datatype check
df_c_o_p_m.dtypes

product_id                  int32
product_name               object
aisle_id                    int16
department_id               int16
prices                    float64
order_id                   object
user_id                    object
order_number                int16
orders_day_of_week          int16
order_hour_of_day           int16
days_without_ordering     float16
add_to_cart_order           int16
reordered                   int16
price_label                object
busiest_days               object
busiest_period_of_day      object
max_order                   int16
loyalty_flag               object
user_mean_price           float64
Spender_habit              object
median_days_no_order      float16
customer_type              object
first_name                 object
surname                    object
gender                     object
state                      object
age                          int8
date_joined                object
number_of_dependants         int8
marital_status             object
income                       int8
_merge                   category
dtype: object

# 06 Export

In [86]:
df_c_o_p_m.to_pickle(os.path.join(path, 'Prepared Data', 'customers_orders_products.pkl'))